=====
Function no args
=====
[functionOne()]
---

    (statement
      (expression
        (function
          (functionName))))

=====
Simple expression
=====
[myFunction('argString')]
---

    (statement
      (expression
        (function
          (functionName)
          (string))))

=====
Multiple arguments
=====
[myFunction('argString', 1, true)]
---

    (statement
      (expression
        (function
          (functionName)
          (string)
          (number)
          (boolean))))

=====
Nested functions
=====
[functionOne('argString', functionTwo(1, functionThree('threeString', 3), 2), 'oneString')]
---

    (statement
      (expression
        (function
          (functionName)
          (string)
          (expression
            (function
              (functionName)
              (number)
              (expression
                (function
                  (functionName)
                  (string)
                  (number)))
              (number)))
          (string))))

=====
Function with dot-notation
=====
[functionOne('argString').prop1.prop2]
---

    (statement
      (expression
        (function
          (functionName)
          (string))
        (memberName)
        (memberName)))

=====
Nested dot-notation
=====
[functionOne(functionTwo(2).prop1.prop2).prop3]
---

    (statement
      (expression
        (function
          (functionName)
          (expression
            (function
              (functionName)
              (number))
            (memberName)
            (memberName)))
        (memberName)))
